{"text": "QUESTION:In the API section of Cangjie programming language,What are the libraries available in the Cangjie programming language?\nANSWER:The Cangjie programming language includes the std module (standard library module) and several commonly used extension modules. Each module contains several packages that provide specific and rich functionalities related to the module.\nThe standard library provides the most common APIs, including input/output functions, basic data structures and algorithms, date and time representations, etc. Extension libraries focus on specific domains, such as the compress module for compression and decompression capabilities, the crypto module for encryption and decryption capabilities, and the net module for efficient network protocol parsing and communication capabilities.\nThe standard library and officially provided extension libraries all comply with the Cangjie language programming specifications and meet official standards in functionality, performance, and security."}
{"text": "QUESTION:In the API section of Cangjie programming language,How to use the libraries or package in the Cangjie programming language?\nANSWER:In the Wukong programming language, a package is the smallest unit of compilation, and each package can output products such as AST files, static library files, dynamic library files, etc., individually. Packages can define sub-packages, thereby forming a tree-like structure. A package without a parent is called a root package, and the entire tree consisting of the root package and its sub-packages (including sub-packages of sub-packages) is called a module (module). The name of the module is the same as that of the root package, and it is the smallest unit published by third-party developers.\nThe import rules for packages are as follows:\nYou can import a top-level declaration or definition from a package, with the syntax:\nimport fullPackageName.itemName\n\nWhere fullPackageName is the full path package name, and itemName is the name of the declaration, for example:\nimport std.collection.ArrayList\n\nIf multiple itemName to be imported are part of the same fullPackageName, you can use:\nimport fullPackageName.{itemName[, itemName]*}\nFor example:import std.collection.{ArrayList, HashMap}\n\nYou can also import all top-level declarations or definitions in the `fullPackageName` package that are decorated with the `public` modifier, with the following syntax:\nimport fullPackageName.*\nFor example:import std.collection.*"}
{"text": "QUESTION:In the API section of Cangjie programming language,What is the std module in Cangjie?\nANSWER:The std module is the standard library that provides a set of predefined functions, classes, and structures to offer common functionalities and tools for developers to write programs more quickly and efficiently."}
{"text": "QUESTION:In the API section of Cangjie programming language,What is the compress module in Cangjie?\nANSWER:The compress module provides compression and decompression capabilities."}
{"text": "QUESTION:In the API section of Cangjie programming language,What is the crypto module in Cangjie?\nANSWER:The crypto module provides security encryption capabilities."}
{"text": "QUESTION:In the API section of Cangjie programming language,What is the encoding module in Cangjie?\nANSWER:The encoding module provides character encoding and decoding capabilities."}
{"text": "QUESTION:In the API section of Cangjie programming language,What is the fuzz module in Cangjie?\nANSWER:The fuzz module provides fuzz testing capabilities based on coverage feedback."}
{"text": "QUESTION:In the API section of Cangjie programming language,What is the log module in Cangjie?\nANSWER:The log module provides capabilities for logging."}
{"text": "QUESTION:In the API section of Cangjie programming language,What is the net module in Cangjie?\nANSWER:The net module provides capabilities for network communication."}
{"text": "QUESTION:In the API section of Cangjie programming language,What is the serialization module in Cangjie?\nANSWER:The serialization module provides serialization and deserialization capabilities."}
