{"text": "'Cangjie programming language_api_fuzz_fuzz_module_overview': 'When using Cangjie Code API, The fuzz module provides fuzz testing capabilities based on coverage feedback. Its main functionality is to automatically generate a large number of random input data to detect the stability and security of the target software under various exceptional conditions.'\n\nCode_Example:\nimport fuzz.*"}
{"text": "'Cangjie programming language_api_fuzz_fuzz_fuzz_package': 'When using Cangjie Code API, The fuzz package provides a Cangjie fuzz engine based on coverage feedback and corresponding interfaces. Developers can write code to test APIs.\n\nThe fuzz package provides developers with a Cangjie fuzz engine based on coverage feedback and corresponding interfaces, allowing developers to write code to test APIs. Currently, it supports fuzz testing by passing mutated byte streams (Array<UInt8>) or standard Cangjie data types (FuzzDataProvider) to the fuzz engine.\n\nThis package requires the SanitizerCoverage feature for coverage feedback instrumentation to be used together. Developers should have a certain understanding of fuzz testing, and beginners are recommended to first learn about C language fuzzing tools libFuzzer.\n\nUsing this package requires an external dependency on the libclang_rt.fuzzer_no_main.a static library provided by the LLVM suite compiler-rt. Currently, it supports Linux and macOS, but does not support Windows.\n\nClass name\tFunction\nFuzzer\tThe Fuzzer class provides the creation of fuzz tools.\nFuzzerBuilder\tThis is used for building Fuzzer classes.\nFuzzDataProvider\tFuzzDataProvider is a utility class designed to convert the byte stream of variant data into standard Cangjie basic data.\nDebugDataProvider\tThis class inherits from FuzzDataProvider and adds additional debug information.'\n\nCode_Example:\nimport fuzz.fuzz.Fuzzer\n\nmain() {\n    Fuzzer(api).startFuzz()\n    return 0\n}\n\n// The tested function will throw an exception when specific conditions are met, and this exception will be caught by the Fuzzer\npublic func api(data: Array<UInt8>): Int32 {\n    if (data.size == 8 && data[0] == b'C' && data[1] == b'a' && data[2] == b'n' && data[3] == b'g' && data[4] == b'j' &&\n        data[5] == b'i' && data[6] == b'e' && data[7] == b'!') {\n        throw Exception(\"TRAP\")\n    }\n    return 0\n}"}
