{"text": "'Cangjie programming language_characters_rune_type': 'In Cangjie code language, The Rune type in Cangjie represents a single Unicode character. It can be used to store any character from the Unicode character set.'\n\nCode_Example:\nlet a: Rune = r'a' //single characters\nlet b: Rune = r\"b\" //single characters"}
{"text": "'Cangjie programming language_characters_rune_literals': 'In Cangjie code language, Rune literals in Cangjie can be represented in three forms: single characters, escape sequences, andand general character.\nSingle characters: A single character enclosed in single quotes or double quotes.\nEscape sequences: Special characters represented using a backslash \\ followed by a specific character. For example, \\n for newline, \\t for tab, and \\\\ for backslash.\nGeneral characters：Start with \\u, followed by 1 to 8 hexadecimal numbers defined within a pair of curly braces, to represent the character corresponding to the Unicode value.'\n\nCode_Example:\nlet slash: Rune = r'\\\\'  //Escape sequences\nlet newLine: Rune = r'\\n'  //Escape sequences\nlet tab: Rune = r'\\t'  //Escape sequences\nlet he: Rune = r'\\u{4f60}'  //General characters\nlet llo: Rune = r'\\u{597d}'  //General characters"}
{"text": "'Cangjie programming language_characters_rune_operations': 'In Cangjie code language, The character type only supports relational operators: less than (<), greater than (>), less than or equal to (<=), greater than or equal to (>=), equal to (==), and not equal to (!=). The comparison is based on the Unicode value of the character.'\n\nCode_Example:\nlet char1: Rune = 'A'\nlet char2: Rune = 'B'\nprintln(char1 < char2) // Output: true\nprintln(char1 == char2) // Output: false"}
{"text": "'Cangjie programming language_characters_rune_encoding': 'In Cangjie code language, The print function in Cangjie defaults to UTF-8 encoding. When working with characters in a Windows environment, you may need to manually set the console encoding to UTF-8 using the command chcp 65001 in the command prompt.'"}
