{"text": "'Cangjie programming language_cjc_CJPM_cjpm_introduction': 'In Cangjie code language, CJPM (Cangjie Package Manager) is the official package management tool for the Cangjie language. It manages and maintains the module system of Cangjie projects and provides a simplified, unified entry point for compilation, supporting custom compilation commands. CJPM also offers a native custom build mechanism in Cangjie, allowing developers to add pre-processing and post-processing steps at different stages of the build process, enabling flexible customization of the build workflow to meet various business needs.'\n\nCode_Example:\n# Viewing CJPM help\ncjpm -h"}
{"text": "'Cangjie programming language_cjc_CJPM_cjpm_initialization': 'In Cangjie code language, The cjpm init command is used to initialize a new Cangjie module or workspace. By default, it creates a cjpm.toml configuration file in the current directory and sets up a src directory with a default main.cj file. Custom initialization options are available and can be viewed using cjpm init -h.'\n\nCode_Example:\n#Input:\n cjpm init\n#Output:\n cjpm init success"}
{"text": "'Cangjie programming language_cjc_CJPM_cjpm_building_projects': 'In Cangjie code language, The cjpm build command is used to build the current Cangjie project. It first checks for dependencies and then calls cjc to perform the build. It supports full, incremental, cross, and parallel compilation. More build options can be viewed using cjpm build -h. The cjpm build -V command prints all compilation process commands.'\n\nCode_Example:\n#input: \ncjpm build -V\n#output:\ncompile package module1.package1: cjc --import-path=target/release --no-sub-pkg --output-dir=target/release/module1 -p src/package1 --output-type=staticlib -o=libmodule1.package1.a\ncompile package module1: cjc --import-path=target/release --output-dir=target/release/bin -L target/release/module1 -lmodule1.package1 -p src --output-type=exe -o=main\ncjpm build success"}
{"text": "'Cangjie programming language_cjc_CJPM_cjpm_toml_configuration': 'In Cangjie code language, The cjpm.toml configuration file is used to configure basic information, dependencies, and compilation options for a Cangjie project. CJPM primarily uses this file for parsing and execution. The file includes sections for package metadata, dependencies, and build settings.'\n\nCode_Example:\n# Example of a cjpm.toml file\n[package]\nname = \"example\"\nversion = \"0.1.0\"\n\n[dependencies]\nsome-library = \"1.0.0\"\n\n[build]\noutput-type = \"executable\""}
