{"text": "'Cangjie programming language_cjc_option_cjc_compile_options': 'In Cangjie code language, This section introduces the commonly used cjc compilation options. If an option also applies to cjc-frontend, it will be marked with [frontend]. If the behavior of the option is different in cjc-frontend, there will be additional explanations.'"}
{"text": "'Cangjie programming language_cjc_option_module_name_option': 'In Cangjie code language, The --module-name option specifies the name of the module to be compiled.\nFor example, if you have a file my_module/src/log/printer.cj and a file main.cj, you can compile the log package and specify its module name as my_module using the following command:\ncjc --module-name my_module my_module/src/log/printer.cj\n\nThis will generate a liblog.a file in the my_module directory.\nThen you can compile main.cj which imports the log package using the following command:\ncjc main.cj -o main -L my_module -llog\n\nThis will compile main.cj and link it with liblog.a to produce an executable named main.'"}
{"text": "'Cangjie programming language_cjc_option_output_option': 'In Cangjie code language, The --output option specifies the path of the output file. The compiler's output will be written to the specified file.\nFor example, the following command will name the output executable file as a.out:\ncjc --output a.out main.cj'"}
{"text": "'Cangjie programming language_cjc_option_library_option': 'In Cangjie code language, The --library option specifies the library file to be linked. The given library file will be directly passed to the linker. This option is usually used in conjunction with --library-path.\nThe file name format should be lib[arg].[extension]. When linking library a, you can use the option -l a, and the linker will search for files like liba.a, liba.so (or liba.dll when linking Windows targets) in the library search directories.'"}
{"text": "'Cangjie programming language_cjc_option_library_path_option': 'In Cangjie code language, The --library-path option specifies the directory where the library files are located. When using the --library option, this option is typically used to specify the directory where the library files are located.\nThe paths specified by --library-path will be added to the linker's library search path. Additionally, paths specified in the LIBRARY_PATH environment variable will also be added to the linker's library search path, with paths specified by --library-path having higher priority.'"}
{"text": "'Cangjie programming language_cjc_option_debug_option': 'In Cangjie code language, The -g option generates an executable or library file with debug information.\nNote: -g can only be used with -O0. Using higher optimization levels may cause debugging functions to behave abnormally.'"}
{"text": "'Cangjie programming language_cjc_option_trimpath_option': 'In Cangjie code language, The --trimpath option removes prefixes from source file path information in debug information. When compiling Cangjie code, cjc saves the absolute path of the source files (.cj files) to provide debugging and exception information at runtime.\nUsing this option, you can remove specified path prefixes from the source file path information. Multiple --trimpath options can be used to specify different path prefixes. For each source file path, the compiler will remove the first matching prefix.'"}
{"text": "'Cangjie programming language_cjc_option_coverage_option': 'In Cangjie code language, The --coverage option generates an executable program that supports code coverage statistics. The compiler will generate a code information file with a .gcno suffix for each compilation unit. After executing the program, each compilation unit will produce an execution statistics file with a .gcda suffix. These files can be used with the cjcov tool to generate a code coverage report for the current execution.\nNote: --coverage can only be used with -O0. If higher optimization levels are used, the compiler will issue a warning and enforce -O0. --coverage is used for compiling executable programs. If used to generate static or dynamic libraries, linking errors may occur when using the library.'"}
{"text": "'Cangjie programming language_cjc_option_int_overflow_option': 'In Cangjie code language, The --int-overflow option specifies the overflow strategy for fixed-precision integer operations. The default is throwing.\nthrowing: Integer operations will throw an exception when overflow occurs.\nwrapping: Integer operations will wrap around to the other end of the fixed-precision integer when overflow occurs.\nsaturating: Integer operations will choose the extreme value of the fixed-precision integer as the result when overflow occurs.'"}
{"text": "'Cangjie programming language_cjc_option_diagnostic_format_option': 'In Cangjie code language, The --diagnostic-format option specifies the format of diagnostic messages. The default is default.\ndefault: Diagnostic messages will be output in the default format (with color).\nnoColor: Diagnostic messages will be output in the default format (without color).\njson: Diagnostic messages will be output in JSON format.\nNote: The Windows version does not support color-rendered error messages.'"}
{"text": "'Cangjie programming language_cjc_option_verbose_option': 'In Cangjie code language, The --verbose option makes cjc print the compiler version information, toolchain dependencies, and commands executed during the compilation process.'"}
{"text": "'Cangjie programming language_cjc_option_help_option': 'In Cangjie code language, The --help option prints the available compilation options. When this option is used, the compiler will only print information about compilation options and will not compile any input files.'\n\nCode_Example:\n# Printing compilation options\ncjc --help"}
{"text": "'Cangjie programming language_cjc_option_version_option': 'In Cangjie code language, The --version option prints the compiler version information. When this option is used, the compiler will only print version information and will not compile any input files.'\n\nCode_Example:\n# Printing compiler version\ncjc --version"}
{"text": "'Cangjie programming language_cjc_option_save_temps_option': 'In Cangjie code language, The --save-temps option retains the intermediate files generated during the compilation process and saves them to the specified path.\nThe compiler will retain intermediate files such as .bc and .o.'\n\nCode_Example:\n# Saving temporary files\ncjc --save-temps /path/to/save main.cj"}
{"text": "'Cangjie programming language_cjc_option_import_path_option': 'In Cangjie code language, The --import-path option specifies the search path for the AST files of imported modules.\nFor example, if you have the following directory structure, with the libs/myModule directory containing the library file and AST export file for the myModule module, and a main.cj file with the following code:\nimport myModule.log\nYou can use the following command to add ./libs to the search path for the AST files of imported modules:\ncjc --import-path ./libs main.cj\nThe --import-path option provides the same functionality as the CANGJIE_PATH environment variable, but paths specified by --import-path have higher priority.'"}
{"text": "'Cangjie programming language_cjc_option_scan_dependency_option': 'In Cangjie code language, The --scan-dependency option can be used to obtain the direct dependencies of a package's source code or a package's .cjo file on other packages, as well as other information, in JSON format.'"}
{"text": "'Cangjie programming language_cjc_option_no_sub_pkg_option': 'In Cangjie code language, The --no-sub-pkg option indicates that the current package has no sub-packages. Enabling this option allows the compiler to further reduce the code size.'"}
{"text": "'Cangjie programming language_cjc_option_warn_on_option': 'In Cangjie code language, The --warn-on option enables all or specific warnings during compilation. The <value> for --warn-on is the same as for --warn-off. --warn-on is usually used in combination with --warn-off. For example, you can use -Woff all -Won <value> to allow only warnings from the <value> group to be printed.\nNote: The order of using --warn-on and --warn-off is significant. For the same group, the latter option will override the previous one. For example, reversing the order in the example above to -Won <value> -Woff all will result in disabling all warnings.'"}
{"text": "'Cangjie programming language_cjc_option_error_count_limit_option': 'In Cangjie code language, The --error-count-limit option limits the maximum number of errors printed by the compiler.\nThe <value> can be all or a non-negative integer. When the parameter is all, the compiler will print all errors generated during compilation. When the parameter is a non-negative integer N, the compiler will print at most N errors. The default value for this option is 8.'"}
{"text": "'Cangjie programming language_cjc_option_output_dir_option': 'In Cangjie code language, The --output-dir option controls the directory where the compiler saves the intermediate and final files.\nFor example, when specifying --output-dir <path1> and also specifying --output <path2>, the intermediate files will be saved to <path1>, and the final output will be saved to <path1>/<path2>.\nNote: When specifying this option along with the --output option, the parameter for the --output option must be a relative path.'"}
{"text": "'Cangjie programming language_cjc_option_static_std_option': 'In Cangjie code language, The --static-std option statically links the std module of the Cangjie library.\nThis option is only effective when compiling dynamic libraries or executable files. By default, cjc statically links the std module of the Cangjie library.'"}
{"text": "'Cangjie programming language_cjc_option_static_libs_option': 'In Cangjie code language, The --static-libs option statically links non-std modules of the Cangjie library.\nThis option is only effective when compiling dynamic libraries or executable files. By default, cjc statically links non-std modules of the Cangjie library.\nNote:\nUsing --static-std and --dy-std together will only make the last option effective.\n--dy-std and --static-libs cannot be used together; otherwise, an error will occur.'"}
{"text": "'Cangjie programming language_cjc_option_dy_libs_option': 'In Cangjie code language, The --dy-libs option dynamically links non-std modules of the Cangjie library.\nThis option is only effective when compiling dynamic libraries or executable files.\nNote:\nUsing --static-libs and --dy-libs together will only make the last input option effective.\n--static-std and --dy-libs cannot be used together; otherwise, an error will occur.\nWhen using --dy-std alone, it will default to enabling --dy-libs and provide a related warning message.\nWhen using --dy-libs alone, it will default to enabling --dy-std and provide a related warning message.'"}
{"text": "'Cangjie programming language_cjc_option_stack_trace_format_option': 'In Cangjie code language, The --stack-trace-format option specifies the format of the stack trace when an exception is thrown.\nThe stack trace formats are as follows:\ndefault: Function names with generic parameters omitted (file name:line number)\nsimple: File name:line number\nall: Full function names (file name:line number)'"}
{"text": "'Cangjie programming language_cjc_option_lto_option': 'In Cangjie code language, The --lto option enables and specifies the Link Time Optimization (LTO) compilation mode.\nNote:\nLTO supports compiling executable files and static libraries in LTO mode (.bc files), but does not support compiling dynamic libraries. Specifying --output-type=dylib in LTO mode will result in a compilation error.\nWindows and macOS platforms do not support this feature.\nWhen enabling LTO, the following optimization options are not allowed: -Os, -Oz.\nLTO supports two compilation modes:\n--lto=full: Full LTO merges all compilation modules together and optimizes globally, providing the maximum optimization potential but requiring longer compilation times.\n--lto=thin: Compared to full LTO, thin LTO uses parallel optimization on multiple modules and supports incremental compilation at link time by default. The compilation time is shorter than full LTO because less global information is available, resulting in less optimization.\nTypically, the optimization effect comparison: full LTO > thin LTO > regular static linking compilation.\nTypically, the compilation time comparison: full LTO > thin LTO > regular static linking compilation.\nLTO optimization use cases:\nCompile an executable file using the following command:\ncjc --lto=full main.cj\nCompile the static library (.bc file) needed in LTO mode and use this library file to compile the executable file.\nNote:\nIn LTO mode, the static library (.bc file) input must specify the path of the file to the Cangjie compiler.\nWhen statically linking the standard library in LTO mode (--static-std & -static-libs), the code of the standard library will also participate in LTO optimization and be statically linked into the executable file. When dynamically linking the standard library (--dy-std & -dy-libs), the dynamic library of the standard library will still be used for linking in LTO mode.'"}
{"text": "'Cangjie programming language_cjc_option_pgo_instr_gen_option': 'In Cangjie code language, The --pgo-instr-gen option enables instrumentation compilation and generates an executable program with instrumentation information.\nCompiling macOS and Windows targets does not support this feature.\nPGO (Profile-Guided Optimization) is a common compilation optimization technique that uses runtime profiling information to further improve program performance. Instrumentation-based PGO is a PGO optimization method that uses instrumentation information and typically involves three steps:\nThe compiler instruments the source code and generates an instrumented executable program.\nRun the instrumented executable program to generate a profile file.\nThe compiler uses the profile file to recompile the source code.\nNote: When running the program, using the environment variable LLVM_PROFILE_FILE=\"test%c.profraw\" can enable continuous mode, which allows the profile file to be generated even if the program crashes or is killed by a signal. However, currently PGO does not support the subsequent optimization steps in continuous mode.'"}
{"text": "'Cangjie programming language_cjc_option_pgo_instr_use_option': 'In Cangjie code language, The --pgo-instr-use option uses the specified profdata profile file to guide compilation and generate an optimized executable program.\nCompiling macOS targets does not support this feature.\nNote: The --pgo-instr-use compilation option only supports profdata format profile files. The llvm-profdata tool can be used to convert profraw profile files to profdata format.'"}
{"text": "'Cangjie programming language_cjc_option_target_option': 'In Cangjie code language, The --target option specifies the target platform's triple for cross-compilation.\nThe <value> is generally a string in the following format: <arch>(-<vendor>)-<os>(-<env>), where:\n<arch> represents the system architecture of the target platform, such as aarch64, x86_64, etc.\n<vendor> represents the vendor of the target platform, commonly pc, apple, etc. In cases where the platform vendor is not significant or unknown, it can be written as unknown or omitted.\n<os> represents the operating system of the target platform, such as Linux, Win32, etc.\n<env> represents the ABI or standard specification of the target platform, used to further distinguish different runtime environments of the same operating system, such as gnu, musl, etc. This can be omitted if the operating system does not require finer differentiation based on <env>.\nCurrently, the supported local and target platforms for cross-compilation by cjc are as follows:\n| Local Platform (host) | Target Platform (target) |\n| --- | --- |\n| x86_64-windows-gnu | aarch64-linux-ohos |\n| x86_64-apple-darwin | aarch64-linux-ohos |\nBefore using the --target option to specify the target platform for cross-compilation, ensure that you have the corresponding cross-compilation toolchain ready, as well as the corresponding Cangjie SDK version that can compile to the target platform and run on the local platform.'"}
{"text": "'Cangjie programming language_cjc_option_toolchain_option': 'In Cangjie code language, The --toolchain option specifies the path where the binary files of the compilation toolchain are located.\nThe binary files include: the compiler, linker, and C runtime target files provided by the toolchain (e.g., crt0.o, crti.o, etc.).\nAfter preparing the compilation toolchain, you can store it in a custom path and then pass this path to the compiler using --toolchain <value> to enable the compiler to call the binary files in that path for cross-compilation.'"}
{"text": "'Cangjie programming language_cjc_option_sysroot_option': 'In Cangjie code language, The --sysroot option specifies the root directory of the compilation toolchain.\nFor cross-compilation toolchains with a fixed directory structure, if there is no need to specify paths outside the root directory for binaries and dynamic or static libraries, you can directly pass the root directory path of the toolchain to the compiler using --sysroot <value>. The compiler will analyze the directory structure based on the target platform type and automatically search for the required binary files and dynamic or static libraries. After using this option, there is no need to specify --toolchain or --library-path parameters.\nSuppose you are cross-compiling to a platform with the triple arch-os-env, and the cross-compilation toolchain has the following directory structure:\n/path/to/toolchain\n├── arch-os-env\n│   ├── bin\n│   │   └── compiler\n│   ├── lib\n│   │   └── crt0.o\n│   └── include\n│       └── header.h\nFor a Cangjie source file hello.cj, you can use the following command to cross-compile hello.cj to the arch-os-env platform:\ncjc --sysroot /path/to/toolchain hello.cj\nYou can also use the shortened parameter:\ncjc -B /path/to/toolchain hello.cj\nIf the toolchain directory conforms to the conventional directory structure, you can also use the following command without specifying --toolchain or --library-path parameters:\ncjc --sysroot /path/to/toolchain hello.cj'"}
{"text": "'Cangjie programming language_cjc_option_strip_all_option': 'In Cangjie code language, The --strip-all option specifies that the compiler should remove the symbol table from the output executable or dynamic library file.'"}
{"text": "'Cangjie programming language_cjc_option_discard_eh_frame_option': 'In Cangjie code language, The --discard-eh-frame option specifies that the compiler should remove the EH frame and EH frame header sections, excluding information related to CRT, to reduce the size of the executable or dynamic library file. This will affect debugging information.\nCompiling macOS targets does not support this feature.'"}
{"text": "'Cangjie programming language_cjc_option_link_options_option': 'In Cangjie code language, The --link-options option passes the specified arguments directly to the linker. The available arguments may vary depending on the linker being used. This option can be used multiple times to specify multiple linker options.\nThe superscript indicates that the linker pass-through options may vary depending on the linker. For specific supported options, please refer to the linker documentation.'"}
{"text": "'Cangjie programming language_cjc_option_profile_compile_time_option': 'In Cangjie code language, The --profile-compile-time option prints data on the time consumed by each compilation stage.'"}
{"text": "'Cangjie programming language_cjc_option_profile_compile_memory_option': 'In Cangjie code language, The --profile-compile-memory option prints data on the memory consumption of each compilation stage.'"}
{"text": "'Cangjie programming language_cjc_option_test_option': 'In Cangjie code language, The --test option is the entry point provided by the unittest testing framework, which is automatically generated by macros. When compiling with cjc --test, the program entry is no longer main, but test_entry. For more information on using the unittest testing framework, please refer to the Cangjie Programming Language Library API documentation.\nFor a Cangjie file a.cj in the pkgc directory:\n// a.cj\nfn main() {\n    println(\"run\")\n}\nfn test_entry() {\n    println(\"test\")\n}\nYou can compile a.cj in the pkgc directory using the following command:\ncjc --test a.cj\nExecuting main will produce the following output:\ntest\nFor the following directory structure:\napplication\n├── pkgc\n│   ├── a1.cj\n│   └── a2.cj\nYou can compile the entire pkgc package's test cases a1.cj and a2.cj in the application directory using the -p compilation option:\ncjc -p pkgc --test'"}
{"text": "'Cangjie programming language_cjc_option_mock_option': 'In Cangjie code language, If on is passed, the package will enable mock compilation, allowing classes in the package to be mocked in test cases. off is an explicit way to disable mock.\nNote: In test mode (when --test is enabled), mock support for the package is automatically enabled, and there is no need to explicitly pass the --mock option.\nruntime-error is only available in test mode (when --test is enabled). It allows compiling packages with mock code but does not perform any mock-related processing in the compiler (which may introduce some overhead and affect the runtime performance of the tests). This can be useful for benchmarking test cases with mock code. When using this compilation option, avoid compiling test cases with mock code and running tests, otherwise a runtime exception will be thrown.'"}
{"text": "'Cangjie programming language_cjc_option_compile_macro_option': 'In Cangjie code language, The --compile-macro option compiles macro definition files and generates the default macro definition dynamic library file.'"}
{"text": "'Cangjie programming language_cjc_option_debug_macro_option': 'In Cangjie code language, The --debug-macro option generates the Cangjie code file after macro expansion. This option can be used to debug macro expansion functionality.'"}
{"text": "'Cangjie programming language_cjc_option_parallel_macro_expansion_option': 'In Cangjie code language, The --parallel-macro-expansion option enables parallel macro expansion to shorten the compilation time for macro expansion.'"}
{"text": "'Cangjie programming language_cjc_option_cfg_option': 'In Cangjie code language, The --cfg option specifies custom compilation conditions.\nFor more information on conditional compilation, please refer to the \"Conditional Compilation\" section.'"}
{"text": "'Cangjie programming language_cjc_option_jobs_option': 'In Cangjie code language, The --jobs option sets the maximum number of parallel jobs allowed during parallel compilation. The value must be a reasonable positive integer. If the value is greater than the maximum parallel capability supported by the hardware, the compiler will execute parallel compilation based on the default settings calculated according to the hardware's parallel capability.\nIf this compilation option is not set, the compiler will execute parallel compilation based on the default settings calculated according to the hardware's parallel capability.\nNote: --jobs 1 indicates that compilation should be performed in a completely serial manner.'"}
{"text": "'Cangjie programming language_cjc_option_aggressive_parallel_compile_option': 'In Cangjie code language, The --aggressive-parallel-compile option enables the compiler to use a more aggressive strategy (which may affect optimization) to perform parallel compilation, in order to achieve higher compilation efficiency.\nNote: The --aggressive-parallel-compile option may be forcibly enabled or disabled by the compiler in certain scenarios.\nIn the following scenarios, the --aggressive-parallel-compile option will be forcibly enabled by the compiler:\n-O0\n-g\nIn the following scenarios, the --aggressive-parallel-compile option will be forcibly disabled by the compiler:\n--fobf-string\n--fobf-const\n--fobf-layout\n--fobf-cf-flatten\n--fobf-cf-bogus\n--lto\n--coverage\nCompiling Windows targets\nCompiling macOS targets'"}
{"text": "'Cangjie programming language_cjc_option_fchir_constant_propagation_option': 'In Cangjie code language, The --fchir-constant-propagation option enables Chir constant propagation optimization.'"}
{"text": "'Cangjie programming language_cjc_option_fno_chir_constant_propagation_option': 'In Cangjie code language, The --fno-chir-constant-propagation option disables Chir constant propagation optimization.'"}
{"text": "'': 'In Cangjie code language, The --fno-chir-constant-propagation option disables Chir constant propagation optimization.'"}
{"text": "'Cangjie programming language_cjc_option_fno_chir_function_inlining_option': 'In Cangjie code language, The --fno-chir-function-inlining option disables Chir function inlining optimization.'"}
{"text": "'Cangjie programming language_cjc_option_fchir_devirtualization_option': 'In Cangjie code language, The --fchir-devirtualization option enables Chir devirtualization optimization.'"}
{"text": "'Cangjie programming language_cjc_option_fno_chir_devirtualization_option': 'In Cangjie code language, The --fno-chir-devirtualization option disables Chir devirtualization optimization.'"}
{"text": "'Cangjie programming language_cjc_option_fast_math_option': 'In Cangjie code language, The --fast-math option enables the compiler to make aggressive and potentially precision-reducing assumptions about floating-point operations to optimize floating-point calculations.'"}
{"text": "'Cangjie programming language_cjc_option_optimization_level_option': 'In Cangjie code language, The -O<N> option specifies the optimization level for code optimization. Higher optimization levels result in more optimized programs but may require longer compilation times.\ncjc defaults to optimization level O0. The current supported optimization levels are: O0, O1, O2, Os, Oz.\nWhen the optimization level is 2, cjc also enables the following options:\n--fchir-constant-propagation\n--fchir-function-inlining\n--fchir-devirtualization\nWhen the optimization level is s, cjc optimizes for code size in addition to the O2 level optimizations.\nWhen the optimization level is z, cjc further reduces code size in addition to the Os level optimizations.\nNote: When the optimization level is s or z, the link-time optimization option --lto=[full|thin] is not allowed.'"}
{"text": "'Cangjie programming language_cjc_option_optimization_option': 'In Cangjie code language, The -O option enables optimization level O1, equivalent to -O1.'"}
{"text": "'Cangjie programming language_cjc_option_fobf_string_option': 'In Cangjie code language, The --fobf-string option enables string obfuscation, which obscures string literals in the code, making it difficult for attackers to statically read string data from the binary program.'"}
{"text": "'Cangjie programming language_cjc_option_fobf_const_option': 'In Cangjie code language, The --fobf-const option enables constant obfuscation, which replaces numerical constants in the code with equivalent, more complex sequences of numerical operations.'"}
{"text": "'Cangjie programming language_cjc_option_fobf_layout_option': 'In Cangjie code language, The --fobf-layout option enables layout obfuscation, which obscures symbols (including function names and global variable names), path names, line numbers, and the order of function arrangements in the code. When this option is used, cjc generates a symbol mapping output file *.obf.map in the current directory. If the --obf-sym-output-mapping option is specified, its parameter value will be used as the symbol mapping output file name. The symbol mapping output file contains the mapping relationship between obfuscated and original symbols, which can be used to deobfuscate symbols.\nNote: Layout obfuscation conflicts with parallel compilation. Do not enable them simultaneously. If both are enabled, parallel compilation will be ineffective.'"}
{"text": "'Cangjie programming language_cjc_option_obf_sym_prefix_option': 'In Cangjie code language, The --obf-sym-prefix option specifies the prefix string added to obfuscated symbols. When this option is set, all obfuscated symbols will have this prefix. This can be used to avoid symbol conflicts when compiling multiple Cangjie packages.'"}
{"text": "'Cangjie programming language_cjc_option_obf_sym_output_mapping_option': 'In Cangjie code language, The --obf-sym-output-mapping option specifies the symbol mapping output file. The symbol mapping output file records the original names, obfuscated names, and file paths of symbols. This file can be used to deobfuscate symbols.'"}
{"text": "'Cangjie programming language_cjc_option_obf_sym_input_mapping_option': 'In Cangjie code language, The --obf-sym-input-mapping option specifies the symbol mapping input file. The layout obfuscation feature uses the mapping relationships in these files to obfuscate symbols. Therefore, when compiling Cangjie packages with calling relationships, use the symbol mapping output file of the called package as the --obf-sym-input-mapping option parameter for the calling package to ensure consistent obfuscation results for the same symbol in both packages.'"}
{"text": "'Cangjie programming language_cjc_option_obf_apply_mapping_file_option': 'In Cangjie code language, The --obf-apply-mapping-file option provides a custom symbol mapping relationship file for layout obfuscation, which will obfuscate symbols according to the relationships in the file.\nThe file format is as follows:\noriginal_symbol_name new_symbol_name\nWhere original_symbol_name is the name before obfuscation, and new_symbol_name is the name after obfuscation. original_symbol_name consists of multiple fields. A field represents a field name, which can be a module name, package name, class name, struct name, enum name, function name, or variable name. Fields are separated by the delimiter .. If the field is a function name, the parameter types of the function must be decorated with parentheses () and appended to the function name. For functions with no parameters, the content within the parentheses is empty. If the field has generic parameters, they must also be appended to the field with parentheses <>.\nLayout obfuscation will replace original_symbol_name in the Cangjie application with new_symbol_name. For symbols not in this file, layout obfuscation will normally use random names for replacement. If the mapping relationships in this file conflict with those in --obf-sym-input-mapping, the compiler will throw an exception and stop compilation.'"}
{"text": "'Cangjie programming language_cjc_option_fobf_export_symbols_option': 'In Cangjie code language, The --fobf-export-symbols option allows layout obfuscation to obfuscate exported symbols. This option is enabled by default when layout obfuscation is enabled.'"}
{"text": "'Cangjie programming language_cjc_option_fno_obf_export_symbols_option': 'In Cangjie code language, The --fno-obf-export-symbols option disables layout obfuscation of exported symbols.'"}
{"text": "'Cangjie programming language_cjc_option_fobf_source_path_option': 'In Cangjie code language, The --fobf-source-path option allows layout obfuscation to obfuscate path information in stack trace information, replacing path names with the string \"SOURCE\". This option is enabled by default when layout obfuscation is enabled.'"}
{"text": "'Cangjie programming language_cjc_option_fno_obf_source_path_option': 'In Cangjie code language, The --fno-obf-source-path option disables layout obfuscation of path information in stack trace information.'"}
{"text": "'Cangjie programming language_cjc_option_fobf_line_number_option': 'In Cangjie code language, The --fobf-line-number option allows layout obfuscation to obfuscate line number information in stack trace information, replacing line numbers with 0. This option is enabled by default when layout obfuscation is enabled.'"}
{"text": "'Cangjie programming language_cjc_option_fno_obf_line_number_option': 'In Cangjie code language, The --fno-obf-line-number option disables layout obfuscation of line number information in stack trace information.'"}
{"text": "'Cangjie programming language_cjc_option_fobf_cf_flatten_option': 'In Cangjie code language, The --fobf-cf-flatten option enables control flow flattening obfuscation, which obfuscates existing control flows in the code, making the transfer logic more complex.'"}
{"text": "'Cangjie programming language_cjc_option_fno_obf_cf_flatten_option': 'In Cangjie code language, The --fno-obf-cf-flatten option disables control flow flattening obfuscation.'"}
{"text": "'Cangjie programming language_cjc_option_fobf_cf_bogus_option': 'In Cangjie code language, The --fobf-cf-bogus option enables bogus control flow obfuscation, which inserts false control flows into the code, making the logic more complex.'"}
{"text": "'Cangjie programming language_cjc_option_fno_obf_cf_bogus_option': 'In Cangjie code language, The --fno-obf-cf-bogus option disables bogus control flow obfuscation.'"}
{"text": "'Cangjie programming language_cjc_option_fobf_all_option': 'In Cangjie code language, The --fobf-all option enables all obfuscation features. Specifying this option is equivalent to enabling the following options simultaneously:\n--fobf-string\n--fobf-const\n--fobf-layout\n--fobf-cf-flatten\n--fobf-cf-bogus'"}
