{"text": "'Cangjie programming language_class_subtype_subtype_relationship': 'In Cangjie code language, In Cangjie, a subtype relationship exists between two types where one type (the subtype) is considered a more specific version of another type (the supertype). This relationship is fundamental for polymorphism and type compatibility in object-oriented programming.\nSubtype relationships in Cangjie can be established through class inheritance, interface implementation, tuple types, function types, and predefined type hierarchies.'"}
{"text": "'Cangjie programming language_class_subtype_subtype_class_inheritance': 'In Cangjie code language, When a class inherits from another class, the subclass becomes a subtype of the superclass. This means that an instance of the subclass can be used wherever an instance of the superclass is expected.'\n\nCode_Example:\nopen class Super { }\nclass Sub <: Super { }"}
{"text": "'Cangjie programming language_class_subtype_subtype_interface_implementation': 'In Cangjie code language, When a type implements an interface, it becomes a subtype of that interface. This means that an instance of the implementing type can be used wherever an instance of the interface is expected.'\n\nCode_Example:\ninterface I1 { }\ninterface I2 { }\ninterface I3 <: I1 & I2 { }\nclass C <: I1 { }\nextend Int64 <: I2 { }\n\nError_case_code:\n// file1.cj\npackage p1\n\npublic class A{}\npublic func get(): Any {\n    return A()\n}\n//"}
{"text": "'': 'In Cangjie code language, '"}
{"text": "'Cangjie programming language_class_subtype_subtype_tuple_types': 'In Cangjie code language, In Cangjie, a tuple type (T1, T2, ..., TN) is a subtype of another tuple type (U1, U2, ..., UN) if each element type Ti is a subtype of the corresponding element type Ui.'\n\nCode_Example:\nopen class C1 { }\nclass C2 <: C1 { }\n\nopen class C3 { }\nclass C4 <: C3 { }\n\nlet t1: (C1, C3) = (C2(), C4()) // OK\nlet t2: (C3, C1) = (C4(), C2()) // OK"}
{"text": "'Cangjie programming language_class_subtype_subtype_function_types': 'In Cangjie code language, In Cangjie, a function type (U1) -> S2 is a subtype of another function type (U2) -> S1 if U2 is a subtype of U1 and S2 is a subtype of S1.'\n\nCode_Example:\nopen class U1 { }\nclass U2 <: U1 { }\nopen class S1 { }\nclass S2 <: S1 { }\n\nfunc f(a: U1): S2 { S2() }\nfunc g(a: U2): S1 { S1() }\nfunc call1() {\n    g(U2()) // Ok.\n    f(U2()) // Ok.\n}\nfunc h(lam: (U2) -> S1): S1 {\n    lam(U2())\n}\nfunc call2() {\n    h(g) // Ok.\n    h(f) // Ok.\n}"}
{"text": "'Cangjie programming language_class_subtype_subtype_predefined': 'In Cangjie code language, Cangjie has some predefined subtype relationships that always hold:\nIdentity: A type T is always a subtype of itself (T <: T).\nNothing: The Nothing type is a subtype of every other type (Nothing <: T).\nAny: Every type T is a subtype of the Any type (T <: Any).\nObject: Every class-defined type is a subtype of the Object type.'"}
{"text": "'Cangjie programming language_class_subtype_subtype_transitivity': 'In Cangjie code language, Subtype relationships in Cangjie are transitive. If A <: B and B <: C, then A <: C.'\n\nCode_Example:\ninterface I1 { }\ninterface I2 <: I1 { }\nclass C <: I2 { }\nextend Bool <: I2 { }"}
{"text": "'Cangjie programming language_class_subtype_subtype_generic_types': 'In Cangjie code language, There are also subtype relationships between generic types,as detailed in the Subtype Relationships section of generic types.'"}
