{"text": "'Cangjie programming language_class_properties_property_definition': 'In Cangjie code language, Properties in Cangjie provide a getter and an optional setter to indirectly access and modify values. They allow for controlled access to data and can be used to implement mechanisms such as access control, data monitoring, debugging, and data binding.\nProperties can be defined in interface, class, struct, enum, and extend.\nA typical property definition includes:\nprop: Declares the property.\ngetter: A function () -> T that returns the value of the property.\nsetter: An optional function (T) -> Unit that sets the value of the property.'\n\nCode_Example:\nclass Foo {\n    public prop a: Int64 {\n        get() { 0 }\n    }\n    public mut prop b: Int64 {\n        get() { 0 }\n        set(v) {}\n    }\n}"}
{"text": "'Cangjie programming language_class_properties_property_usage': 'In Cangjie code language, Properties can be used as expressions or assigned values. They provide a way to encapsulate data and control access to it.The getter and setter of the property correspond to two different functions.\nThe getter function type is () -> T, and T is the type of the property, and the getter function is executed when the property is used as an expression.\nThe setter function type is (T) -> Unit, T is the type of the property, the parameter name needs to be specified explicitly, and the setter function will be executed when the property is assigned.The parameters in the setter correspond to the values that were passed in when the values were assigned.\nGetters and setters can contain declarations and expressions in the same way as function bodies, and the rules are the same as those for function bodies.\nIt is important to note that accessing the property itself in the getter and setter of the property is a recursive call, and an endless loop can occur just like a function call.'\n\nCode_Example:\nclass Foo {\n    private var j = 0\n    public mut prop i: Int64 {\n        get() {\n            j\n        }\n        set(v) {\n            j = v\n        }\n    }\n}"}
{"text": "'Cangjie programming language_class_properties_property_modifiers': 'In Cangjie code language, Properties can be modified with the following modifiers:\nopen: Allows the property to be overridden in subclasses.\noverride: Used to override a property from a superclass.\nredef: Used to redefine a property in a subclass.\nmut: Indicates that the property has a setter.'\n\nCode_Example:\nopen class A {\n    private var valueX = 0\n    private static var valueY = 0\n    public open prop x: Int64 {\n        get() { valueX }\n    }\n    public static mut prop y: Int64 {\n        get() { valueY }\n        set(v) {\n            valueY = v\n        }\n    }\n}\nclass B <: A {\n    private var valueX2 = 0\n    private static var valueY2 = 0\n    public override prop x: Int64 {\n        get() { valueX2 }\n    }\n    public redef static mut prop y: Int64 {\n        get() { valueY2 }\n        set(v) {\n            valueY2 = v\n        }\n    }\n}"}
{"text": "'Cangjie programming language_class_properties_property_abstract': 'In Cangjie code language, Abstract properties are declared in interface and abstract class without implementations. They must be implemented by the types that implement the interface or inherit the abstract class.\nAbstract properties: Must be implemented by the implementing type.\nImplementation: The implementing type must provide both getter and setter implementations if the abstract property is mut.'\n\nCode_Example:\ninterface I {\n    prop a: Int64\n    mut prop b: Int64\n}\nclass C <: I {\n    private var value = 0\n    public prop a: Int64 {\n        get() { value }\n    }\n    public mut prop b: Int64 {\n        get() { value }\n        set(v) {\n            value = v\n        }\n    }\n}"}
{"text": "'Cangjie programming language_class_properties_property_static': 'In Cangjie code language, Static properties are defined using the static keyword and are associated with the type rather than instances of the type. They can be accessed through the type name.'\n\nCode_Example:\nclass A {\n    public prop x: Int64 {\n        get() {\n            123\n        }\n    }\n    public static prop y: Int64 {\n        get() {\n            321\n        }\n    }\n}\nmain() {\n    var a = A()\n    println(a.x) // 123\n    println(A.y) // 321\n}"}
{"text": "'Cangjie programming language_class_properties_property_restrictions': 'In Cangjie code language, Properties without mut modifiers are like variables declared by let, and cannot be assigned.\nProperties with mut modifiers are similar to variables declared by var and can be valued or assigned.'\n\nCode_Example:\n//Properties without mut\nclass A {\n    private let value = 0\n    public prop i: Int64 {\n        get() {\n            value\n        }\n    }\n}\nmain() {\n    var x = A()\n    println(x.i) // OK\n    x.i = 1 // Error\n}\n//Properties with mut \nclass A {\n    private var value: Int64 = 0\n    public mut prop i: Int64 {\n        get() {\n            value\n        }\n        set(v) {\n            value = v\n        }\n    }\n}\nmain() {\n    var x = A()\n    println(x.i) // OK\n    x.i = 1 // OK\n}"}
{"text": "'Cangjie programming language_class_properties_property_member': 'In Cangjie code language, Member properties can be instance member properties or static member properties. They are accessed similarly to member variables.\nInstance member properties: Accessed through instances of the class.\nStatic member properties: Accessed through the class name.'\n\nCode_Example:\nclass A {\n    public prop x: Int64 {\n        get() {\n            123\n        }\n    }\n    public static prop y: Int64 {\n        get() {\n            321\n        }\n    }\n}\nmain() {\n    var a = A()\n    println(a.x) // 123\n    println(A.y) // 321\n}"}
