{"text": "'Cangjie programming language_exception_exception_overview': 'In Cangjie code language, Exceptions in Cangjie are special errors that can be caught and handled by programmers. They represent abnormal behavior during program execution, such as array out-of-bounds, division by zero, overflow, or illegal input. To ensure system correctness and robustness, many software systems include extensive error detection and handling code.\nExceptions are not part of the normal program functionality. Once an exception occurs, the program must immediately handle it by transferring control from normal execution to the exception handling part. Cangjie provides an exception handling mechanism to deal with various runtime exceptions.\nIn Cangjie, exceptions are divided into two main categories:\nError: Represents internal system errors and resource exhaustion errors during runtime. Applications should not throw this type of error. If an internal error occurs, it should be reported to the user and the program should terminate safely.\nException: Represents logical errors during runtime or IO errors, such as array out-of-bounds or attempting to open a non-existent file. These exceptions need to be caught and handled in the program.\nDEVELOPERS CANNOT inherit from the built-in Error or its subclasses to define custom exceptions, but they can inherit from the built-in Exception or its subclasses.'\n\nCode_Example:\nopen class FatherException <: Exception {\n    public init() {\n        super(\"This is FatherException.\")\n    }\n    public init(message: String) {\n        super(message)\n    }\n    public open override func getClassName(): String {\n        \"FatherException\"\n    }\n}\n\nclass ChildException <: FatherException {\n    public init() {\n        super(\"This is ChildException.\")\n    }\n    public open override func getClassName(): String {\n        \"ChildException\"\n    }\n}"}
{"text": "'Cangjie programming language_exception_exception_classes': 'In Cangjie code language, Cangjie has two main exception classes: Error and Exception.\nError:\nRepresents internal system errors and resource exhaustion errors.\nMain functions:\nopen prop message: String: Returns detailed information about the error.\nopen func toString(): String: Returns the error type name and detailed information.\nfunc printStackTrace(): Unit: Prints stack trace information to the standard error stream.\nException:\nRepresents logical errors or IO errors during runtime.\nMain functions:\ninit(): Default constructor.\ninit(message: String): Constructor that sets the exception message.\nopen prop message: String: Returns detailed information about the exception.\nopen func toString(): String: Returns the exception type name and detailed information.\nfunc getClassName(): String: Returns the user-defined class name. Subclasses need to override this method to return their own name.\nfunc printStackTrace(): Unit: Prints stack trace information to the standard error stream.'"}
