{"text": "'Cangjie programming language_function_overload_function_overloading_definition': 'In Cangjie code language, Function overloading in Cangjie allows multiple functions with the same name to be defined in the same scope, as long as their parameter lists differ. This can be achieved by varying the number of parameters or the types of parameters.'\n\nCode_Example:\n// Overloading by parameter count\nfunc add(a: Int64, b: Int64): Int64 {\n    return a + b\n}\nfunc add(a: Int64, b: Int64, c: Int64): Int64 {\n    return a + b + c\n}\nprintln(add(1, 2)) // Output: 3\nprintln(add(1, 2, 3)) // Output: 6"}
{"text": "'Cangjie programming language_function_overload_function_overloading_generic': 'In Cangjie code language, Two generic functions with the same name can be overloaded if their non-generic parts differ after renaming the type parameters. If the non-generic parts are identical, it is considered a redefinition error.'\n\nCode_Example:\ninterface I1{}\ninterface I2{}\nfunc f1<X, Y>(a: X, b: Y) {}\nfunc f1<Y, X>(a: X, b: Y) {} // Ok: after rename generic type parameter, it will be 'func f1<X, Y>(a: Y, b: X)'\nfunc f2<T>(a: T) where T <: I1 {}\nfunc f2<T>(a: T) where T <: I2 {} // Error, not overloading"}
{"text": "'Cangjie programming language_function_overload_function_overloading_constructors': 'In Cangjie code language, Two constructor parameters within the same class are different, constituting an overload.'\n\nCode_Example:\nclass C {\n    var a: Int64\n    var b: Float64\n    public init(a: Int64, b: Float64) {\n        this.a = a\n        this.b = b\n    }\n    public init(a: Int64) {\n        b = 0.0\n        this.a = a\n    }\n}"}
{"text": "'Cangjie programming language_function_overload_function_overloading_inheritance': 'In Cangjie code language, If a subclass defines a function with the same name as a function in the superclass, but with different parameters, it is considered an overload. The subclass and superclass are considered the same scope for overloading purposes.'"}
{"text": "'Cangjie programming language_function_overload_function_overloading_resolution': 'In Cangjie code language, When a function is called, the compiler resolves which function to call based on the following rules:\nPrefer functions from higher scope levels (inner scopes have higher levels).\nIf multiple functions have the same highest scope level, choose the most specific function.\nIf no unique most specific function exists, the compiler reports an error.'\n\nCode_Example:\nopen class Base {}\nclass Sub <: Base {}\nfunc outer() {\n    func g(a: Sub) {\n        print(\"1\")\n    }\n    func inner() {\n        func g(a: Base) {\n            print(\"2\")\n        }\n        g(Sub())   // Output: 2\n    }\n}"}
{"text": "'Cangjie programming language_function_overload_function_overloading_restrictions': 'In Cangjie code language, Static member functions and instance member functions of classes, interfaces, and structs cannot overload each other.\nConstructors, static member functions, and instance member functions of enum types cannot overload each other.\nVariables and functions cannot have the same name in the same scope.'"}
