{"text": "'Cangjie programming language_identifier_identifier_concept': 'In Cangjie code language, In the Cangjie programming language, developers can name certain program elements, and these names are called \"identifiers\". Before learning about identifiers, it is necessary to understand some concepts of the Unicode character set. In the Unicode standard, the XID_Start and XID_Continue properties are used to mark characters that can be used as the starting and subsequent characters of a Unicode identifier. The detailed definitions can be found in the Unicode standard documentation. Cangjie uses Unicode Standard 15.0.0.The identifiers of the Cangjie programming language are divided into two categories: ordinary identifiers and primitive identifiers, which follow different naming conventions.'"}
{"text": "'Cangjie programming language_identifier_regular_identifier': 'In Cangjie code language, Regular identifiers in Cangjie cannot be the same as Cangjie keywords. They are composed of the following character sequences:\nStarting with an XID_Start character, followed by any length of XID_Continue characters.\nStarting with an underscore (_), followed by at least one XID_Continue character.\nCangjie recognizes all identifiers in Normalization Form C (NFC). If two identifiers are equal after NFC normalization, they are considered the same identifier.'\n\nCode_Example:\nabc\n_abc\nabc_\na1b2c3\n\nError_case_code:\n123abc (starts with a digit)\na-b (contains a hyphen)"}
{"text": "'Cangjie programming language_identifier_raw_identifier': 'In Cangjie code language, Raw identifiers are formed by enclosing a regular identifier or a Cangjie keyword with a pair of backticks (`). They are mainly used to C treatangjie keywords as identifiers.'\n\nCode_Example:\n`abc\n`abc123`\n\nError_case_code:\n`123invalid` (invalid content within backticks)"}
{"text": "'Cangjie programming language_identifier_identifier_normalization': 'In Cangjie code language, Cangjie treats all identifiers in Normalization Form C (NFC). If two identifiers are equal after NFC normalization, they are considered the same identifier.'"}
