{"text": "'Cangjie programming language_macros_package_macro_package_definition': 'In Cangjie code language, In Cangjie, macros must be defined in a package declared with macro package. Only macro definitions are allowed to be visible outside the package. Other declarations within the package are not visible.\nRe-exported declarations are allowed to be visible outside the package. For more information on package management and re-exporting, refer to the \"Package Import\" section.'\n\nCode_Example:\n// file define.cj\nmacro package define // Compile define.cjo to carry the macro attribute\nimport std.ast.*\npublic func A() {} // Error. The macro package does not allow the definition of non-macro definitions visible externally. An error will be reported here\npublic macro M(input: Tokens): Tokens {// macro M is visible externally\nreturn input\n}"}
{"text": "'Cangjie programming language_macros_package_macro_package_reexport': 'In Cangjie code language, In a macro package, it is allowed to re-export declarations from other macro packages and non-macro packages. However, in a non-macro package, only non-macro package declarations can be re-exported.'\n\nCode_Example:\n# Define macro M1 in package A\nmacro package A\nimport std.ast.*\npublic macro M1(input: Tokens): Tokens {\n    return input\n}\n# The compilation command is as follows:\ncjc A.cj --compile-macro\n\n#Define a public function f1 in non-macro package B. \npackage B\n// public import A.* // Error, it is not allowed to re-export a macro package in a package.\npublic func f1(input: Int64): Int64 {\n    return input\n}\n\n#The compilation command is as follows\ncjc B.cj --output-type=dylib -o libB.so\n\n#Define macro M2 in macro package C\nmacro package C\npublic import A.* // correct: macro package is allowed to re-export in a macro package.\npublic import B.* // correct: non-macro package is also allowed to re-export in a macro package.\nimport std.ast.*\npublic macro M2(input: Tokens): Tokens {\n    return @M1(input) + Token(TokenKind.NL) + quote(f1(1))\n}\n#The compilation command is as follows：\ncjc C.cj --compile-macro -L. -lB"}
{"text": "'Cangjie programming language_macros_package_macro_package_compilation': 'In Cangjie code language, Macro packages must be compiled with the --compile-macro option. If the macro package depends on other dynamic libraries, they must be linked explicitly during compilation.'\n\nCode_Example:\n# Compiling macro package A\ncjc A.cj --compile-macro\n\n# Compiling macro package C with dependency on B\ncjc C.cj --compile-macro -L. -lB"}
{"text": "'Cangjie programming language_macros_package_using_macro_package': 'In Cangjie code language, To use macros from a macro package, import the macro package and use the macros as defined. If the macro package re-exports symbols from other packages, these symbols can be used directly after importing the macro package.'"}
