{"text": "'Cangjie programming language_package_package_overview': 'In Cangjie code language, In Cangjie, a package is the smallest unit of compilation. Each package can independently produce output files such as AST files, static libraries, or dynamic libraries. Each package has its own namespace, and within the same package, there cannot be top-level definitions or declarations with the same name (except for function overloading). A package can contain multiple source files.'\n\nCode_Example:\n// Example of defining a package\npackage myPackage\n\n// Example of a function within the package\nfun myFunction() {\n    println(\"This is a function in myPackage\")\n}"}
{"text": "'Cangjie programming language_package_package_module': 'In Cangjie code language, A module in Cangjie is a collection of several packages and is the smallest unit of distribution for third-party developers. The entry point of a module's program must be in its root directory, and there can be at most one top-level main function as the entry point. The main function either has no parameters or takes an Array<String> as a parameter and returns an integer or Unit.'"}
{"text": "'Cangjie programming language_package_package_declaration': 'In Cangjie code language, In Cangjie, a package declaration starts with the keyword package followed by the package name path, which is separated by dots (.) from the root package to the current package. The package name must be a valid identifier (excluding raw identifiers). For example:\npackage pkg1 // root package pkg1\npackage pkg1.sub1 // The sub1 of the root package pkg1\nThe package declaration must be on the first non-empty, non-comment line of a source file, and all source files in the same package must have consistent package declarations.'\n\nCode_Example:\n// file 1\n// Comments are accepted\npackage test\n// declarations...\n\n// file 2\nlet a = 1 // Error, package declaration must appear first in a file\npackage test\n// declarations..."}
{"text": "'Cangjie programming language_package_package_naming_conventions': 'In Cangjie code language, The package name should reflect the path of the source file relative to the project's root directory (src), with path separators replaced by dots (.). For example, if the source code is located in src/directory_0/directory_1 and the root package name is pkg, the package declaration should be package pkg.directory_0.directory_1.\nThe directory name must match the package name.\nThe default source root directory is named src.\nPackages directly under the source root directory can omit the package declaration, in which case the compiler will assign the package name default.'\n\nCode_Example:\n// The directory structure is as follows:\nsrc\n`-- directory_0\n    |-- directory_1\n    |    |-- a.cj\n    |    `-- b.cj\n    `-- c.cj\n`-- main.cj\n//The package declarations in a.cj, b.cj, and c.cj can be:\n\n// a.cj\n// in file a.cj, the declared package name must correspond to relative path directory_0/directory_1.\npackage default.directory_0.directory_1\n\n// b.cj\n// in file b.cj, the declared package name must correspond to relative path directory_0/directory_1.\npackage default.directory_0.directory_1\n\n// c.cj\n// in file c.cj, the declared package name must correspond to relative path directory_0.\npackage default.directory_0\n\n// main.cj\n// file main.cj is in the module root directory and may omit package declaration.\nmain() {\n    return 0\n}"}
{"text": "'Cangjie programming language_package_package_declaration_restrictions': 'In Cangjie code language, Package declarations must not cause naming conflicts. A subpackage cannot have the same name as a top-level declaration in the current package.\nThe file folder name must match the package name.'\n\nError_case_code:\n// a.cj\npackage a\npublic class B { // Error, 'B' is conflicted with sub-package 'a.B'\n    public static func f() {}\n}\n\n// b.cj\npackage a.B\npublic func f {}\n\n// main.cj\nimport a.B // ambiguous use of 'a.B'\n\nmain() {\n    a.B.f()\n    return 0\n}"}
