{"text": "'Cangjie programming language_struct_define_struct_definition': 'In Cangjie code language, Structs in Cangjie are defined using the struct keyword, followed by the struct name and a body enclosed in curly braces. The body can contain member variables, properties, static initializers, constructors, and member functions.'\n\nCode_Example:\nstruct Rectangle {\n    let width: Int64\n    let height: Int64\n    public init(width: Int64, height: Int64) {\n        this.width = width\n        this.height = height\n    }\n    public func area() {\n        width * height\n    }\n}"}
{"text": "'Cangjie programming language_struct_define_struct_member_variables': 'In Cangjie code language, Member variables in structs can be instance member variables or static member variables. Instance member variables are accessed through struct instances, while static member variables are accessed through the struct type name.\nInstance member variables: Can be defined without initial values but must have a type annotation.\nStatic member variables: Must be initialized in a static initializer.'\n\nCode_Example:\nstruct Rectangle {\n    let width = 10\n    let height = 20\n}"}
{"text": "'Cangjie programming language_struct_define_struct_static_initializer': 'In Cangjie code language, Static initializers in structs are defined using the static init keyword. They are used to initialize static member variables. A struct can have at most one static initializer.'\n\nCode_Example:\nstruct Rectangle {\n    static let degree: Int64\n    static init() {\n        degree = 180\n    }\n}\n\nError_case_code:\nstruct Rectangle {\n    static let degree: Int64\n    static init() {\n        degree = 180\n    }\n    static init() { // Error, redefinition with the previous static init function\n        degree = 180\n    }\n}"}
{"text": "'Cangjie programming language_struct_define_struct_constructors': 'In Cangjie code language, struct supports two classes of constructors: normal constructors and main constructors.\nThe common constructor starts with the keyword init, followed by the parameter list and the function body, and the initialization of all uninitialized instance member variables must be completed in the function body (if the parameter name and the member variable name cannot be distinguished, you can use this in front of the member variable to distinguish it, this represents the current instance of the struct), otherwise the compilation error will be reported.\nMultiple normal constructors can be defined in a single struct, but they must constitute an overload (see Function Overloads), otherwise the weight is defined incorrectly.'\n\nCode_Example:\nstruct Rectangle {\n    let width: Int64\n    let height: Int64\n    public init(width: Int64) {\n        this.width = width\n        this.height = width\n    }\n\n    public init(width: Int64, height: Int64) { // Ok: overloading with the first init function\n        this.width = width\n        this.height = height\n    }\n\n    public init(height: Int64) { // Error, redefinition with the first init function\n        this.width = height\n        this.height = height\n    }\n}"}
{"text": "'Cangjie programming language_struct_define_struct_member_functions': 'In Cangjie code language, Member functions in structs can be instance member functions or static member functions. Instance member functions are accessed through struct instances, while static member functions are accessed through the struct type name. Static member functions cannot access instance member variables or call instance member functions.'\n\nCode_Example:\nstruct Rectangle {\n    let width: Int64 = 10\n    let height: Int64 = 20\n    public func area() {\n        this.width * this.height\n    }\n    public static func typeName(): String {\n        \"Rectangle\"\n    }\n}"}
{"text": "'Cangjie programming language_struct_define_struct_access_modifiers': 'In Cangjie code language, Struct members (including member variables, properties, constructors, member functions, and operator functions) can be modified with four access modifiers: private, internal, protected, and public. The default access modifier is internal.\nprivate: Visible only within the struct definition.\ninternal: Visible only within the current package and subpackages.\nprotected: Visible only within the current module.\npublic: Visible both within and outside the module.'\n\nCode_Example:\npackage a\npublic struct Rectangle {\n    public var width: Int64\n    var height: Int64\n    private var area: Int64\n    ...\n}\nfunc samePkgFunc() {\n    var r = Rectangle(10, 20)\n    r.width = 8               // Ok: public 'width' can be accessed here\n    r.height = 24             // Ok: 'height' has no modifier and can be accessed here\n    r.area = 30               // Error, private 'area' can't be accessed here\n}\n\npackage b\nimport a.*\nmain() {\n    var r = Rectangle(10, 20)\n    r.width = 8               // Ok: public 'width' can be accessed here\n    r.height = 24             // Error, no modifier 'height' can't be accessed here\n    r.area = 30               // Error, private 'area' can't be accessed here\n}"}
{"text": "'Cangjie programming language_struct_define_struct_recursive_prohibited': 'In Cangjie code language, Recursive and mutually recursive struct definitions are not allowed in Cangjie.'\n\nError_case_code:\nstruct R1 { // Error, 'R1' recursively references itself\n    let other: R1\n}\nstruct R2 { // Error, 'R2' and 'R3' are mutually recursive\n    let other: R3\n}\nstruct R3 { // Error, 'R2' and 'R3' are mutually recursive\n    let other: R2\n}"}
