{"text": "QUESTION:In Cangjie code language,What is the Array type in Cangjie?\nANSWER:The Array<T> type in Cangjie represents a collection of elements of type T, where T can be any type. Arrays are used to store ordered sequences of data. Arrays in Cangjie are reference types, meaning they hold references to their elements.let numbers: Array<Int64> = [1, 2, 3, 4, 5]\nlet names: Array<String> = [\"Alice\", \"Bob\", \"Charlie\"]"}
{"text": "QUESTION:In Cangjie code language,How are Array literals represented in Cangjie?\nANSWER:Array literals in Cangjie are represented by enclosing a comma-separated list of values within square brackets []. The type of the array is inferred by the compiler based on the types of the elements.let a: Array<String> = [] // Created an empty Array whose element type is String\nlet b = [1, 2, 3, 3, 2, 1] // Created a Array whose element type is Int64, containing elements 1, 2, 3, 3, 2, 1"}
{"text": "QUESTION:In Cangjie code language,How are Arrays initialized in Cangjie?\nANSWER:Arrays in Cangjie can be initialized using literals or by using the Array constructor. The constructor allows specifying the element type and an initial value or a lambda expression to initialize the elements.\nIt is important to note that when initializing an Array with the initial values specified by item, this constructor does not copy the item. If the item is a reference type, after construction, every element in the array will point to the same reference.let a = Array<Int64>() // Created an empty Array whose element type is Int64\nlet b = Array<Int64>(a) // Use another Array to initialize b\nlet c = Array<Int64>(3, item: 0) // Created an Array whose element type is Int64, length is 3 and all elements are initialized as 0\nlet d = Array<Int64>(3, {i => i + 1}) // Created an Array whose element type is Int64, length is 3 and all elements are initialized by the initialization function"}
{"text": "QUESTION:In Cangjie code language,How are elements accessed in an Array in Cangjie?\nANSWER:Elements in an Array can be accessed using the subscript syntax array[index], where index is an Int64 value starting from 0. The index must be within the bounds of the array; otherwise, a runtime exception is thrown.let numbers: Array<Int64> = [1, 2, 3, 4, 5]\nprintln(numbers[0]) // Output: 1\nprintln(numbers[4]) // Output: 5\n\nError_case:\nlet numbers: Array<Int64> = [1, 2, 3, 4, 5]\nprintln(numbers[-1]) // Error: Index out of bounds\nprintln(numbers[5]) // Error: Index out of bounds"}
{"text": "QUESTION:In Cangjie code language,How are Arrays iterated in Cangjie?\nANSWER:Arrays in Cangjie can be iterated using a for-in loop. The elements are accessed in the order they were inserted.main() {\n    let arr = [0, 1, 2]\n    for (i in arr) {\n        println(\"The element is ${i}\")\n    }\n}\n//output：\n//The element is 0\n//The element is 1\n//The element is 2"}
{"text": "QUESTION:In Cangjie code language,How is Array slicing performed in Cangjie?\nANSWER:Array slicing in Cangjie can be performed using the subscript syntax with a Range type. The syntax array[start..end] returns a subarray from start to end (inclusive).\nWhen a Range literal is used in index syntax, the start or end can be omitted.When the start is omitted, the Range starts from 0; when the end is omitted, the Range's end extends to the last element.\nIf you want to retrieve elements from a specific segment of an Array, you can pass a Range type value in the index to obtain a segment of the Array corresponding to the Range at once.let arr1 = [0, 1, 2, 3, 4, 5, 6]\nlet arr2 = arr1[..3] // arr2 contains elements 0, 1, 2\nlet arr3 = arr1[2..] // arr3 contains elements 2, 3, 4, 5, 6"}
{"text": "QUESTION:In Cangjie code language,How is the size of an Array obtained in Cangjie?\nANSWER:The size of an Array in Cangjie can be obtained using the size property, which returns the number of elements in the array.main() {\n    let arr = [0, 1, 2]\n    if (arr.size == 0) {\n        println(\"This is an empty array\")\n    } else {\n        println(\"The size of array is ${arr.size}\")\n    }\n}\n//output：The size of array is 3"}
{"text": "QUESTION:In Cangjie code language,How are Arrays modified in Cangjie?\nANSWER:Arrays in Cangjie are mutable, meaning their elements can be modified. Elements can be updated using the subscript syntax array[index] = value.\nArray is a Collection type with a fixed length, so it does not provide member functions for adding or removing elements.main() {\n    let arr = [0, 1, 2, 3, 4, 5]\n    arr[0] = 3\n    println(\"The first element is ${arr[0]}\")\n}\n//output：The first element is 3"}
{"text": "QUESTION:In Cangjie code language,How is the reference of an Array instance in Cangjie?\nANSWER:Modifying an Array element will affect all references to that instance.\nArray, although it is a struct type, only holds references to its elements internally. Therefore, when used as an expression, it does not copy the elements. All references of the same Array instance share the same element data.let arr1 = [0, 1, 2]\nlet arr2 = arr1\narr2[0] = 3\n// arr1 contains elements 3, 1, 2\n// arr2 contains elements 3, 1, 2"}
{"text": "QUESTION:In Cangjie code language,What is the VArray type in Cangjie?\nANSWER:The VArray<T, $N> type in Cangjie represents a value-type array with a fixed length $N and element type T. VArrays are useful for reducing heap memory allocation and garbage collection overhead compared to reference-type arrays. However, they incur additional performance costs due to copying during assignment and function calls.type varr1 = VArray<Int64, $3>\n\nError_case:\ntype varr2 = VArray //cannot omit <T, $N>"}
{"text": "QUESTION:In Cangjie code language,How are VArrays initialized in Cangjie?\nANSWER:VArrays in Cangjie can be initialized using literals or constructors. The length of the VArray must be specified at compile time.// Using literals\nlet numbers: VArray<Int64, $5> = [1, 2, 3, 4, 5]\n\n// Using constructor\n// VArray<T, $N>(initElement: (Int64) -> T)\nlet b = VArray<Int64, $5>({ i => i}) // [0, 1, 2, 3, 4]\n// VArray<T, $N>(item!: T)\nlet c = VArray<Int64, $5>(item: 0) // [0, 0, 0, 0, 0]"}
{"text": "QUESTION:In Cangjie code language,How are elements accessed in a VArray in Cangjie?\nANSWER:Elements in a VArray can be accessed using the subscript syntax varray[index], where index is an Int64 value starting from 0. The index must be within the bounds of the VArray.var a: VArray<Int64, $3> = [1, 2, 3]\nlet i = a[1] // i is 2"}
{"text": "QUESTION:In Cangjie code language,How are VArrays modified in Cangjie?\nANSWER:VArrays in Cangjie are mutable, meaning their elements can be modified. Elements can be updated using the subscript syntax varray[index] = value.let numbers: VArray<Int64, $5> = [1, 2, 3, 4, 5]\nnumbers[0] = 10\nprintln(numbers) // Output: [10, 2, 3, 4, 5]"}
{"text": "QUESTION:In Cangjie code language,How is the size of a VArray obtained in Cangjie?\nANSWER:The size of a VArray in Cangjie can be obtained using the size property, which returns the number of elements in the VArray. The type of the size property is Int64.var a: VArray<Int64, $3> = [1, 2, 3]\nlet s = a.size // s is 3"}
{"text": "QUESTION:In Cangjie code language,What are the constraints of VArray in Cangjie?\nANSWER:VArrays in Cangjie have the following constraints:\nThe element type T cannot contain reference types, enum types, lambda expressions (except CFunc), or uninstantiated generic types.\nThe length $N must be a compile-time constant."}
