{"text": "QUESTION:In Cangjie code language,What is an expression in Cangjie?\nANSWER:In traditional programming languages, an expression is composed of one or more operands combined by zero or more operators. Every expression has a computation process and a result. In Cangjie, the definition of an expression is extended to include any evaluatable language element. Cangjie expressions include arithmetic expressions, conditional expressions, loop expressions, try expressions and partial control transition expressions (break and continue). Since Cangjie is a strongly-typed language, every expression has a specific type."}
{"text": "QUESTION:In Cangjie code language,What is an expression block in Cangjie?\nANSWER:In a Cangjie program, a set of expressions surrounded by a pair of curly braces \"{}\", known as a \"code block\", will act as a sequential execution stream of the program, in which the expressions will be executed sequentially in the order in which they are encoded. If there is at least one expression in a block, the value and type of the block are equal to the value and type of the last expression, and if there is no expression in the block, the empty block is of type Unit and the value is ().A block of code is not an expression in itself and cannot be used on its own, it will be attached to the execution and evaluation of functions, conditional expressions, loop expressions, etc."}
{"text": "QUESTION:In Cangjie code language,What are the types of expressions in Cangjie?\nANSWER:Cangjie expressions can be categorized into arithmetic expressions, conditional expressions (if, if-let), loop expressions (for-in, while, do-while, while-let), try expressions and partial control transition expressions (break and continue). Each type of expression has specific rules for evaluation and type determination."}
{"text": "QUESTION:In Cangjie code language,How are expressions evaluated in Cangjie?\nANSWER:Expressions in Cangjie are evaluated based on the rules defined for each type of expression. The evaluation process involves computing the operands and applying the operators or control flow constructs as specified."}
{"text": "QUESTION:In Cangjie code language,What types of conditional expressions are included？\nANSWER:Conditional expressions are divided into if expressions and if-let expressions, and their values and types need to be determined according to the usage scenario."}
{"text": "QUESTION:In Cangjie code language,What types of conditional expressions are included？\nANSWER:There are four types of loop expressions: for-in expressions, while expressions, do-while expressions, and while-let expressions, all of which are of type Unit and have a value of (). Both if-let expressions and while-let expressions are related to pattern matching."}
{"text": "QUESTION:In Cangjie code language,How does the if expression work in Cangjie?\nANSWER:The if expression in Cangjie has the following form:\nif (condition) {\n    // branch 1\n} else {\n    // branch 2\n}\nWhere \"condition\" is a boolean type expression, and \"branch 1\" and \"branch 2\" are two blocks of code.  If the condition is true, branch 1 is executed; otherwise, branch 2 is executed. The type of the if expression is determined by the context and the types of the branches.\nCangjie programming language is strongly typed, if the condition of the expression can only be Boolean type, can not use integers or floating-point numbers and other types, and C language and so on, Cangjie does not take whether the conditional value is 0 as the basis for branch selection.import std.random.*\nmain() {\n    let number: Int8 = Random().nextInt8()\n    println(number)\n    if (number % 2 == 0) {\n        println(\"even number\")\n    } else {\n        println(\"odd number\")\n    }\n}\n\nError_case:\nmain() {\n    let number = 1\n    if (number) { // Error, mismatched types\n        println(\"nonzero number\")\n    }\n}"}
{"text": "QUESTION:In Cangjie code language,How does the else-if expression work in Cangjie?\nANSWER:In many scenarios, when one condition is not true, it may be necessary to determine another condition or conditions before executing the corresponding action, Cangjie allows a new if expression to be followed by else, thus supporting multi-level condition judgment and branch execution.import std.random.*\nmain() {\n    let speed = Random().nextFloat64() * 20.0\n    println(\"${speed} km/s\")\n    if (speed > 16.7) {\n        println(\"The third cosmic velocity\")\n    } else if (speed > 11.2) {\n        println(\"The second cosmic velocity\")\n    } else if (speed > 7.9) {\n        println(\"The first cosmic velocity\")\n    } else {\n        println(\"Be down-to-earth\")\n    }\n}"}
{"text": "QUESTION:In Cangjie code language,What are the working rules of the if expression\nANSWER:The value and type of the if expression need to be determined according to the form and scenario:\nWhen an if expression with an else branch is evaluated, the type of if expression needs to be determined based on the context in which it is evaluated:1.If the context explicitly requires that the value type be T, then the type of each branch code block of the if expression must be a subtype of T, then the type of the if expression is determined to be T, and if the subtype constraint is not satisfied, the compilation will report an error.2.If the context doesn't have explicit type requirements, the type of the if expression is the smallest common parent of each of its branch block types, and compilation will result in an error if the minimum common parent type doesn't exist.\nIf the compilation passes, the value of the if expression is the value of the block of branch code that is executed.\nIn order to prevent the above type checking rules from affecting this habit of thinking, Cangjie stipulates that the if expression type in this scenario is Unit and the value is (), and each branch does not participate in the above type checking.\nFor if expressions that do not contain an else branch, since the if branch may not be executed, the type of such if expressions is specified as Unit and the value is ().main() {\n    let zero: Int8 = 0\n    let one: Int8 = 1\n    let voltage = 5.0\n    let bit = if (voltage < 2.5) {\n        zero\n    } else {\n        one\n    }\n}"}
{"text": "QUESTION:In Cangjie code language,How does the while expression work in Cangjie?\nANSWER:The while expression in Cangjie has the following form:\nwhile (condition) {\n    // loop body\n}\nwhere \"condition\" is a boolean type expression and \"loop body\" is a block of code. The loop body is executed repeatedly as long as the condition is true.main() {\n    var root = 0.0\n    var min = 1.0\n    var max = 2.0\n    var error = 1.0\n    let tolerance = 0.1 ** 10\n    while (error ** 2 > tolerance) {\n        root = (min + max) / 2.0\n        error = root ** 2 - 2.0\n        if (error > 0.0) {\n            max = root\n        } else {\n            min = root\n        }\n    }\n    println(\"The square root of 2 is approximately equal to：${root}\")\n}"}
{"text": "QUESTION:In Cangjie code language,How does the do-while expression work in Cangjie?\nANSWER:The do-while expression in Cangjie has the following form:\ndo {\n    // loop body\n} while (condition)\nwhere \"condition\" is a boolean type expression and \"loop body\" is a block of code.The loop body is executed at least once, and then the condition is evaluated. If the condition is true, the loop continues.import std.random.*\nmain() {\nlet random = Random()\nvar totalPoints = 0\nvar hitPoints = 0\ndo {\n// Randomly select points in the square ((0, 0), (1, 1))\nlet x = random.nextFloat64()\nlet y = random.nextFloat64()\n// Determine whether it falls within the inscribed circle of the square\nif ((x - 0.5) ** 2 + (y - 0.5) ** 2 < 0.25) {\nhitPoints++\n}\ntotalPoints++\n} while (totalPoints < 1000000)\nlet pi = 4.0 * Float64(hitPoints)/Float64(totalPoints)\nprintln(\" The approximate value of PI is: ${pi}\")\n}\n//Running the above program, it will output:The approximate value of PI is: 3.141872"}
{"text": "QUESTION:In Cangjie code language,How does the for-in expression work in Cangjie?\nANSWER:The for-in expression in Cangjie has the following form:\nfor (variable in sequence) {\n    // loop body\n}\nWhere the \"loop body\" is a block of code. An Iteration Variable is a single identifier or a tuple of multiple identifiers that binds the data pointed to by the iterator in each iteration and can be used as a local variable in a Loop Body. A \"sequence\" is an expression that is evaluated only once, and the traversal is done against the value of this expression, and its type must extend the iterator interface Iterable<T>. Cangjie's built-in types such as compartments and arrays have been extended with the Iterable<T> interface.\nIn the loop body of a for-in expression, iteration variables cannot be modified.main(){\n    let array = [1, 2, 3, 4, 5]\n    for (item in array) {\n        print(item)\n    }\n}\n// Output: 12345\n\nError_case:\nmain() {\n    for (i in 0..5) {\n        i = i * 10 // Error, cannot assign to value which is an initialized 'let' constant\n        println(i)\n    }\n}"}
{"text": "QUESTION:In Cangjie code language,How does the for-in expression traverse interval type instances in Cangjie?\nANSWER:for-in expressions can traverse interval type instances.main() {\n    var sum = 0\n    for (i in 1..=100) {\n        sum += i\n    }\n    println(sum)\n}\n//output:5050"}
{"text": "QUESTION:In Cangjie code language,How does the for-in expression traverse the sequence of tuples type instances in Cangjie?\nANSWER:If the elements of a sequence are tuple-type, the Iterative Variable can be written as a tuple when traversing using a for-in expression.main() {\n    let array = [(1, 2), (3, 4), (5, 6)]\n    for ((x, y) in array) {\n        println(\"${x}, ${y}\")\n    }\n}\n//output:1, 2/n3, 4/n5, 6"}
{"text": "QUESTION:In Cangjie code language,How does the wildcard _ instead of iterating variables in Cangjie?\nANSWER:In some scenarios, where you only need to loop through certain operations but don't use iteration variables, you can use wildcard _ instead of iterating variables.\nIn this scenario, if you define an iteration variable with a normal identifier, the compilation will output an \"unused variable\" alarm, which can be avoided by using the wildcard _.main() {\n    var number = 2\n    for (_ in 0..5) {\n        number *= number\n    }\n    println(number)\n}\n//output:4294967296"}
{"text": "QUESTION:In Cangjie code language,How does the where expression work in Cangjie?\nANSWER:you can use the where keyword to guide a Boolean expression after the traversed \"sequence\", so that before each time it will enter the loop body execution, the expression will be evaluated first, and if the value is true, the loop body will be executed. Otherwise, it goes directly to the next round of the cycle.main() {\n    for (i in 0.. 8 where i % 2 == 1) {// The loop body will be executed only when i is an odd number\n        print(i)\n    }\n}\n//output:1357"}
{"text": "QUESTION:In Cangjie code language,How does the break expression work in Cangjie?\nANSWER:The break expression is used to terminate the execution of a loop expression. It can be used inside the loop body of for-in, while, or do-while expressions.main() {\n    let numbers = [12, 18, 25, 36, 49, 55]\n    for (number in numbers) {\n        if (number % 5 == 0) {\n            println(number)\n            break\n        }\n    }\n}\n//output:25"}
{"text": "QUESTION:In Cangjie code language,How does the continue expression work in Cangjie?\nANSWER:The continue expression is used to skip the current iteration of a loop and proceed to the next iteration. It can be used inside the loop body of for-in, while, or do-while expressions.main() {\n    let numbers = [12, 18, 25, 36, 49, 55]\n    for (number in numbers) {\n        if (number % 2 == 0) {\n            continue\n        }\n        println(number)\n    }\n}\n//output:25/n49/n55"}
