{"text": "QUESTION:In Cangjie code language,What is a function type in Cangjie?\nANSWER:In Cangjie, functions are first-class citizens, meaning they can be used as parameters, return values, and assigned to variables. The type of a function is determined by its parameter types and return type, denoted as (T1, T2, ..., TN) -> R, where T1 to TN are the parameter types and R is the return type.\nA function type consists of a function's argument type and a return type, and the -> connection is used between the argument type and the return type. Parameter types are enclosed in parentheses () and can have 0 or more parameters, and if there is more than one, the parameter types are separated by commas (,).// Function with no parameters and Unit return type\nfunc hello(): Unit {\n    println(\"Hello, World!\")\n}\n\n// Function with one parameter and Unit return type\nfunc display(x: Int64): Unit {\n    println(x)\n}\n\n// Function with two parameters and Int64 return type\nfunc add(a: Int64, b: Int64): Int64 {\n    return a + b\n}\n\n// Function with two parameters and tuple return type\nfunc returnTuple(a: Int64, b: Int64): (Int64, Int64) {\n    return (a, b)\n}"}
{"text": "QUESTION:In Cangjie code language,How are type parameters specified in function types in Cangjie?\nANSWER:Function types can have explicit type parameter names. These names are used to provide more descriptive information about the parameters. For example, name and price can be used as type parameter names.\nIn addition, for a function type, only the type parameter name can be written uniformly, or the type parameter name cannot be written uniformly, and cannot exist alternately.func showFruitPrice(name: String, price: Int64) {\n    println(\"fruit: ${name} price: ${price} yuan\")\n}\nmain() {\n    let fruitPriceHandler: (name: String, price: Int64) -> Unit\n    fruitPriceHandler = showFruitPrice\n    fruitPriceHandler(\"banana\", 10)\n}\n\nError_case:\nlet handler: (name: String, Int64) -> Int64   // Error"}
{"text": "QUESTION:In Cangjie code language,How is a function type used as a parameter in Cangjie?\nANSWER:A function type can be used as a parameter type in another function. This allows functions to accept other functions as arguments.func printAdd(add: (Int64, Int64) -> Int64, a: Int64, b: Int64): Unit {\n    println(add(a, b))\n}"}
{"text": "QUESTION:In Cangjie code language,How is a function type used as a return type in Cangjie?\nANSWER:A function type can also be used as the return type of another function. This allows functions to return other functions.func add(a: Int64, b: Int64): Int64 {\n    a + b\n}\nfunc returnAdd(): (Int64, Int64) -> Int64 {\n    add\n}\nmain() {\n    var a = returnAdd()\n    println(a(1,2))\n}"}
{"text": "QUESTION:In Cangjie code language,How is a function type used as a variable in Cangjie?\nANSWER:A function name itself is an expression with a function type. Functions can be assigned to variables, allowing functions to be stored and passed around like any other value.func add(p1: Int64, p2: Int64): Int64 {\n    p1 + p2\n}\nlet f: (Int64, Int64) -> Int64 = add"}
{"text": "QUESTION:In Cangjie code language,How does function type overloading work in Cangjie?\nANSWER:If a function is overloaded in the current scope, using the function name directly may cause ambiguity. The compiler will report an error if the function name is ambiguous.func add(i: Int64, j: Int64) {\n    i + j\n}\nfunc add(i: Float64, j: Float64) {\n    i + j\n}\nmain() {\n    var plus: (Int64, Int64) -> Int64 = add  // OK\n}\n\nError_case:\nfunc add(i: Int64, j: Int64) {\n    i + j\n}\nfunc add(i: Float64, j: Float64) {\n    i + j\n}\nmain() {\n    var f = add   // Error, ambiguous function 'add'\n}"}
