{"text": "QUESTION:In Cangjie code language,How to define a non-attribute macro in Cangjie?\nANSWER:A non-attribute macro in Cangjie accepts only the code to be transformed and does not accept additional parameters. The definition format is as follows:\nimport std.ast.*\npublic macro MacroName(args: Tokens): Tokens {\n    ... // Macro body\n}\nThe format of the macro is as follows:@MacroName(...)\nWhen the macro is applied to a declaration, the parentheses can usually be omitted."}
{"text": "QUESTION:In Cangjie code language,How to call a non-attribute macro in Cangjie?\nANSWER:Non-attribute macros are called using @MacroName(). The input inside the parentheses can be any valid Tokens or empty. When applied to a declaration, the parentheses can be omitted.@MacroName func name() {}        // Before a FuncDecl\n@MacroName struct name {}        // Before a StructDecl\n@MacroName class name {}         // Before a ClassDecl\n@MacroName(#\"abc\"#)\n@MacroName(`class`)"}
{"text": "QUESTION:In Cangjie code language,What are the rules for macro input in Cangjie?\nANSWER:The input to a macro must be a sequence of valid Tokens. Special characters like \"#\", `` ```, and\"\"are not valid Tokens and cannot be used as input. Unmatched parentheses must be escaped with\"\". The \"@\"symbol must also be escaped with\"\"` if used as input.// Illegal input Tokens\n@MacroName(#)    // Not a whole Token\n@MacroName(`)    // Not a whole Token\n@MacroName(()    // ( and ) not match\n@MacroName(\\[)   // Escape for unsupported symbol\n\n// Legal input Tokens\n@MacroName(#\"abc\"#)\n@MacroName(`class`)\n@MacroName([)\n@MacroName([])\n@MacroName(\\()\n@MacroName(\\@)"}
{"text": "QUESTION:In Cangjie code language,What are the rules for macro expansion in Cangjie?\nANSWER:Macro expansion operates on the Cangjie syntax tree. After expansion, the code must still be valid Cangjie code. The expanded code must not contain package declarations or import statements. When a macro is applied to a declaration, the input must be a valid declaration if parentheses are omitted."}
{"text": "QUESTION:In Cangjie code language,How to define an attribute macro in Cangjie?\nANSWER:An attribute macro in Cangjie accepts an additional Tokens parameter for additional information. The definition format is:\n// Macro definition with attribute\npublic macro Foo(attrTokens: Tokens, inputTokens: Tokens): Tokens {\n    return attrTokens + inputTokens  // Concatenate attrTokens and inputTokens.\n}"}
{"text": "QUESTION:In Cangjie code language,How to call an attribute macro in Cangjie?\nANSWER:Attribute macros are called using @[MacroName(attrTokens)](inputTokens). The attrTokens are passed within square brackets, and the inputTokens are passed within parentheses."}
{"text": "QUESTION:In Cangjie code language,What are the rules for nested macros in Cangjie?\nANSWER:Cangjie does not support nested macro definitions. However, it conditionally supports nested macro calls within macro definitions and macro calls."}
{"text": "QUESTION:In Cangjie code language,How do nested macro calls work in Cangjie?\nANSWER:Nested macro calls are supported in Cangjie. The inner macros are expanded first, followed by the outer macros. This rule applies to both attribute and non-attribute macros."}
{"text": "QUESTION:In Cangjie code language,How to pass messages between nested macros in Cangjie?\nANSWER:Inner macros can use the assertParentContext function to ensure they are nested within a specific outer macro. They can also use setItem to send key-value pairs to outer macros, which can receive them using getChildMessages."}
