{"text": "QUESTION:In Cangjie code language,What access modifiers are available for top-level declarations in Cangjie?\nANSWER:In Cangjie, access modifiers control the visibility of top-level declarations such as types, variables, and functions. There are four access modifiers: private, internal, protected, and public. Their semantics when applied to top-level elements are as follows:\nprivate: Visible only within the current file.\ninternal: Visible within the current package and its subpackages (including nested subpackages).\nprotected: Visible within the current module.\npublic: Visible both within and outside the module.\nThe visibility levels are ordered as follows: public > protected > internal > private.\n| Modifier    | File | Package & Subpackages | Module | All Packages |\n| ----------- | ---- | --------------------- | ------ | ------------ |\n| `private`   | Y    | N                     | N      | N            |\n| `internal`  | Y    | Y                     | N      | N            |\n| `protected` | Y    | Y                     | Y      | N            |\n| `public`    | Y    | Y                     | Y      | Y            |package a\nprivate func f1() {1} // f1 is only visible within the current file\nfunc f2() {2} // f2 is only visible within the current package and its subpackages\nprotected func f3() {3} // f3 is visible only within the current module\npublic func f4() {4} // f4 is visible both inside and outside the current module"}
{"text": "QUESTION:In Cangjie code language,What are the default access modifiers for top-level declarations in Cangjie?\nANSWER:Different top-level declarations support different access modifiers and have default modifiers (which can also be explicitly specified):\npackage: Supports internal, protected, public; default is public.\nimport: Supports all access modifiers; default is private.\nOther top-level declarations: Support all access modifiers; default is internal.\n\nError_case:\n// a.cj\npackage a\n\n//Arguments and return values in function declarations\nclass C {}\npublic func f1(a1: C) // Error, public declaration f1 cannot use internal type C.\n{\n    return 0\n}\npublic func f2(a1: Int8): C // Error, public declaration f2 cannot use internal type C.\n{\n    return C()\n}\npublic func f3 (a1: Int8) // Error, public declaration f3 cannot use internal type C.\n{\n    return C()\n}\n\n//Variable declarations\npublic let v1: C = C() // Error, public declaration v1 cannot use internal type C.\npublic let v2 = C() // Error, public declaration v2 cannot use internal type C.\n\n//The class inherited from the class declaration\nopen class C1 {}\npublic class C2 <: C1 {} // Error, public declaration C2 cannot use internal type C1.\n\n//type-implemented interfaces\ninterface I {}\npublic enum E <: I { A } // Error, public declaration uses internal types.\n\n//Type arguments for generic types\npublic class C1<T> {}\nclass C2 {}\npublic let v1 = C1<C2>() // Error, public declaration v1 cannot use internal type C2.\n\n//where constraint in the upper bound of the type\ninterface I {}\npublic class B<T> where T <: I {}  // Error, public declaration B cannot use internal type I."}
{"text": "QUESTION:In Cangjie code language,What are the rules for using access modifiers in Cangjie?\nANSWER:The access level of a declaration must not be higher than the access level of the types it uses.\npublic declarations can use any types visible within the package, including public and non-public types.\npublic top-level declarations can use anonymous functions or any top-level functions, including public and non-public ones.\nBuilt-in types such as Rune, Int64, etc., are implicitly public.// a.cj\npackage a\nclass C1 {}\nfunc f1(a1: C1)\n{\n  return 0\n}\npublic func f2(a1: Int8) // Ok.\n{\n  var v1 = C1()\n  return 0\n}\npublic let v1 = f1(C1()) // Ok.\npublic class C2 // Ok.\n{\n  var v2 = C1()\n}\n\npublic var t1: () -> Unit = { => } // Ok.\nfunc s1(): Unit {}\npublic let t2 = s1 // Ok.\npublic func s2() // Ok.\n{\n  return s1\n}\n\nvar num = 5\npublic var t3 = num // Ok."}
