{"text": "QUESTION:In Cangjie code language,What is the Tuple type in Cangjie?\nANSWER:A tuple in Cangjie is a composite type that groups multiple values of potentially different types into a single type. The tuple type is denoted by (T1, T2, ..., TN), where T1 to TN can be any types, separated by commas. Tuples must have at least two elements. For example, (Int64, Float64) represents a binary tuple type, and (Int64, Float64, String) represents a ternary tuple type.\nThe length of a tuple is fixed, meaning once a tuple instance of a tuple type is defined, its length cannot be changed.\nA tuple is an immutable type, meaning once a tuple instance of a tuple type is defined, its contents cannot be updated.let pair: (Int64, Float64) = (10, 3.14)\nlet triple: (Int64, Float64, String) = (10, 3.14, \"example\")\n\nError_case:\nvar tuple = (true, false)\ntuple[0] = false // Error, 'tuple element' can not be assigned"}
{"text": "QUESTION:In Cangjie code language,How are tuple literals represented in Cangjie?\nANSWER:Tuple literals in Cangjie are represented by enclosing expressions within parentheses, separated by commas. For example, (e1, e2, ..., eN) represents a tuple literal with N elements.let x: (Int64, Float64) = (3, 3.141592)\nlet y: (Int64, Float64, String) = (3, 3.141592, \"PI\")"}
{"text": "QUESTION:In Cangjie code language,How are elements accessed in a tuple in Cangjie?\nANSWER:Elements in a tuple can be accessed using the syntax t[index], where t is the tuple and index is an integer literal starting from 0. The index must be less than the number of elements in the tuple.main() {\n    var pi = (3.14, \"PI\")\n    println(pi[0])  //output：3.140000\n    println(pi[1])  //output：PI\n}\n\nError_case:\nlet pair = (10, 3.14)\nprintln(pair[2]) // Error: Index out of range"}
{"text": "QUESTION:In Cangjie code language,How is tuple destructuring performed in Cangjie?\nANSWER:In assignment expressions, tuple literals can be used to destructure the right-hand side of an expression, which requires the left-hand side of the assignment expression to be a tuple literal. The elements inside this tuple literal must all be lvalues (lvalues are expressions that appear on the left side of the assignment operator and can hold values, see the description of assignment operations in each chapter for details) or a tuple literal. When an underscore _ appears in the tuple literal, it indicates that the evaluation result at the corresponding position on the right-hand side of the tuple is ignored (meaning the type check at this position is always passable), and the expression on the right-hand side of the equals sign must also be a tuple type. Each element of the right-hand tuple must be a subtype of the corresponding lvalue type. Note that compound assignment does not support this deconstruction method. In terms of evaluation order, the expression on the right-hand side of the equals sign is calculated first, and then the lvalue part is assigned from left to right one by one.var a: Int64\nvar b: String\nvar c: Unit\nfunc f() { ((1, \"abc\"), ()) }\n((a, b), c) = f() // value of a is 1, value of b is \"abc\", value of c is '()'\n((a, b), _) = ((2, \"def\"), 3.0) // value of a is 2, value of b is \"def\", 3.0 is ignored"}
{"text": "QUESTION:In Cangjie code language,How are type parameters specified for tuples in Cangjie?\nANSWER:Type parameters can be explicitly specified for tuples to provide more descriptive names for the elements. For example, (name: String, age: Int32) specifies a tuple with named type parameters. Type parameters must be uniformly specified or omitted for all elements in a tuple.\nFor a tuple type, it is only allowed to uniformly specify or not specify the type parameter name, and alternation is not permitted. Additionally, the parameter name itself cannot be used as a variable or to access elements within the tuple.func getFruitPrice (): (name: String, price: Int64) {\n    return (\"banana\", 10)\n}\nlet person: (name: String, age: Int32) = (\"Alice\", 30)\nprintln(person.name) // Output: \"Alice\"\nprintln(person.age) // Output: 30\n\nError_case:\nlet invalidTuple: (name: String, age: Int32) = (\"Alice\", 30, \"extra\") // Error: Mismatched number of elements\nlet a: (name: String, Int64) = (\"banana\", 5)   // Error\nlet b: (name: String, price: Int64) = (\"banana\", 5) // OK\nb.name // Error"}
{"text": "QUESTION:In Cangjie code language,Are tuples mutable in Cangjie?\nANSWER:Tuples in Cangjie are immutable. Once a tuple is created, its elements cannot be modified. This ensures that the tuple's contents remain constant throughout its lifetime.let pair = (10, 3.14)\n// pair[0] = 20 // Error: Tuples are immutable"}
{"text": "QUESTION:In Cangjie code language,What is the length of a tuple in Cangjie?\nANSWER:The length of a tuple in Cangjie is fixed and determined at the time of its definition. Once a tuple is created, its length cannot be changed."}
{"text": "QUESTION:In Cangjie code language,How are tuples used in Cangjie?\nANSWER:Tuples are commonly used to group related data together in a single unit. They are useful for returning multiple values from functions, handling multiple variables simultaneously, and representing structured data."}
